Repository: altendorfme/sdfw
Catalog: src/Sdfw.Ui/Localization/Resources.*.resx
Languages: pt_br

# Nav_DnsProviders
source: DNS Providers
pt_br: Provedores DNS

# Nav_NetworkAdapters
source: Network Adapters
pt_br: Adaptadores de Rede

# Nav_Settings
source: Settings
pt_br: Configurações

# Dashboard_Provider
source: Provider: {0}
pt_br: Provedor: {0}

# Dashboard_NoActiveProvider
source: No active provider
pt_br: Nenhum provedor ativo

# Dashboard_Default
source: Default: {0}
pt_br: Padrão: {0}

# Dashboard_Enable
source: Enable
pt_br: Ativar

# Dashboard_Disable
source: Disable
pt_br: Desativar

# Dashboard_Revert
source: Revert
pt_br: Reverter

# Dashboard_RevertToDefault
source: Revert to default provider
pt_br: Reverter para provedor padrão

# Dashboard_QueriesProcessed
source: Queries Processed
pt_br: Consultas Processadas

# Dashboard_FlushDnsCache
source: Flush DNS Cache
pt_br: Limpar Cache DNS

# Dashboard_RefreshStatus
source: Refresh Status
pt_br: Atualizar Status

# Status_Inactive
source: Inactive
pt_br: Inativo

# Status_Connected
source: Connected
pt_br: Conectado

# Status_ConnectedTemporary
source: Connected (temporary)
pt_br: Conectado (temporário)

# Status_Connecting
source: Connecting...
pt_br: Conectando...

# Status_Testing
source: Testing...
pt_br: Testando...

# Status_Error
source: Error
pt_br: Erro

# Adapters_Title
source: Network Adapters
pt_br: Adaptadores de Rede

# Adapters_Save
source: Save
pt_br: Salvar

# Adapters_Refresh
source: Refresh
pt_br: Atualizar

# Adapters_ShowAll
source: Show all adapters
pt_br: Mostrar todos os adaptadores

# Adapters_SelectAll
source: Select all
pt_br: Selecionar todos

# Adapters_ClearSelection
source: Clear selection
pt_br: Limpar seleção

# Adapters_DnsAutomatic
source: DNS: Automatic
pt_br: DNS: Automático

# Providers_Title
source: DNS Providers
pt_br: Provedores DNS

# Providers_Add
source: Add
pt_br: Adicionar

# Providers_ResetList
source: Reset DNS list
pt_br: Resetar lista de DNS

# Providers_Active
source: Active
pt_br: Ativo

# Providers_SetAsDefault
source: Set as default
pt_br: Definir como padrão

# Providers_Test
source: Test
pt_br: Testar

# Providers_Edit
source: Edit
pt_br: Editar

# Providers_Delete
source: Delete
pt_br: Excluir

# Providers_Connect
source: Connect (temporary)
pt_br: Conectar (temporário)

# Providers_Disconnect
source: Disconnect
pt_br: Desconectar

# Providers_DefaultAlreadyActive
source: The default provider is already active.
pt_br: O provedor padrão já está ativo.

# Providers_ConnectedTemporary
source: Connected temporarily to {0}
pt_br: Conectado temporariamente a {0}

# Providers_DisconnectedTemporary
source: Temporary connection disconnected
pt_br: Conexão temporária desconectada

# Providers_DefaultSet
source: {0} set as default
pt_br: {0} definido como padrão

# Providers_CannotDeleteDefault
source: Cannot delete the default provider. Set another provider as default first.
pt_br: Não é possível excluir o provedor padrão. Defina outro provedor como padrão primeiro.

# Providers_Deleted
source: Provider {0} deleted
pt_br: Provedor {0} excluído

# Providers_Saved
source: Provider {0} saved
pt_br: Provedor {0} salvo

# Providers_ResetBlockedCustomDefault
source: The default provider is custom. Set a built-in provider as default first.
pt_br: O provedor padrão é customizado. Defina um provedor built-in como padrão primeiro.

# Providers_ResetSuccess
source: DNS list reset to original values
pt_br: Lista de DNS resetada para valores originais

# Providers_ResetFailed
source: Failed to reset DNS list
pt_br: Falha ao resetar lista de DNS

# ProviderDialog_Title
source: DNS Provider
pt_br: Provedor DNS

# ProviderDialog_Name
source: Name
pt_br: Nome

# ProviderDialog_NamePlaceholder
source: E.g.: Google DNS
pt_br: Ex: Google DNS

# ProviderDialog_Description
source: Description (optional)
pt_br: Descrição (opcional)

# ProviderDialog_DescriptionPlaceholder
source: E.g.: Google's public DNS
pt_br: Ex: DNS público do Google

# ProviderDialog_Type
source: Type
pt_br: Tipo

# ProviderDialog_TypeStandard
source: Standard DNS
pt_br: DNS Padrão

# ProviderDialog_PrimaryIpv4
source: Primary IPv4
pt_br: IPv4 Primário

# ProviderDialog_PrimaryIpv4Placeholder
source: E.g.: 8.8.8.8
pt_br: Ex: 8.8.8.8

# ProviderDialog_SecondaryIpv4
source: Secondary IPv4 (optional)
pt_br: IPv4 Secundário (opcional)

# ProviderDialog_SecondaryIpv4Placeholder
source: E.g.: 8.8.4.4
pt_br: Ex: 8.8.4.4

# ProviderDialog_PrimaryIpv6
source: Primary IPv6 (optional)
pt_br: IPv6 Primário (opcional)

# ProviderDialog_PrimaryIpv6Placeholder
source: E.g.: 2001:4860:4860::8888
pt_br: Ex: 2001:4860:4860::8888

# ProviderDialog_SecondaryIpv6
source: Secondary IPv6 (optional)
pt_br: IPv6 Secundário (opcional)

# ProviderDialog_SecondaryIpv6Placeholder
source: E.g.: 2001:4860:4860::8844
pt_br: Ex: 2001:4860:4860::8844

# ProviderDialog_DohUrl
source: DoH URL
pt_br: URL DoH

# ProviderDialog_DohUrlPlaceholder
source: E.g.: https://dns.google/dns-query
pt_br: Ex: https://dns.google/dns-query

# ProviderDialog_BootstrapIps
source: Bootstrap IPs (optional, one per line)
pt_br: Bootstrap IPs (opcional, um por linha)

# ProviderDialog_BootstrapIpsPlaceholder
source: E.g.: 8.8.8.8
pt_br: Ex: 8.8.8.8

# ProviderDialog_Cancel
source: Cancel
pt_br: Cancelar

# ProviderDialog_Save
source: Save
pt_br: Salvar

# ProviderDialog_ValidationTitle
source: Validation
pt_br: Validação

# ProviderDialog_ValidationError
source: Please fix the following issues:
pt_br: Por favor, corrija os seguintes itens:

# ProviderDialog_ErrorNameRequired
source: Name is required
pt_br: Nome é obrigatório

# ProviderDialog_ErrorPrimaryIpv4Required
source: Primary IPv4 is required for Standard DNS
pt_br: IPv4 Primário é obrigatório para DNS Padrão

# ProviderDialog_ErrorPrimaryIpv4Invalid
source: Primary IPv4 is invalid
pt_br: IPv4 Primário é inválido

# ProviderDialog_ErrorSecondaryIpv4Invalid
source: Secondary IPv4 is invalid
pt_br: IPv4 Secundário é inválido

# ProviderDialog_ErrorPrimaryIpv6Invalid
source: Primary IPv6 is invalid
pt_br: IPv6 Primário é inválido

# ProviderDialog_ErrorSecondaryIpv6Invalid
source: Secondary IPv6 is invalid
pt_br: IPv6 Secundário é inválido

# ProviderDialog_ErrorDohUrlRequired
source: DoH URL is required for DNS-over-HTTPS
pt_br: URL DoH é obrigatória para DNS-over-HTTPS

# ProviderDialog_ErrorDohUrlInvalid
source: DoH URL must be an absolute HTTPS URL
pt_br: URL DoH deve ser uma URL HTTPS absoluta

# ProviderDialog_ErrorBootstrapIpInvalid
source: Bootstrap IP is invalid: {0}
pt_br: Bootstrap IP inválido: {0}

# Settings_Title
source: Settings
pt_br: Configurações

# Settings_RestoreDefaults
source: Restore defaults
pt_br: Restaurar padrões

# Settings_Save
source: Save
pt_br: Salvar

# Settings_Behavior
source: Behavior
pt_br: Comportamento

# Settings_MinimizeToTray
source: Minimize to system tray
pt_br: Minimizar para a bandeja do sistema

# Settings_CloseToTray
source: Close to system tray
pt_br: Fechar para a bandeja do sistema

# Settings_StartWithWindows
source: Start with Windows
pt_br: Iniciar com o Windows

# Settings_StartMinimized
source: Start minimized
pt_br: Iniciar minimizado

# Settings_Appearance
source: Appearance
pt_br: Aparência

# Settings_Theme
source: Theme
pt_br: Tema

# Settings_Language
source: Language
pt_br: Idioma

# Settings_CheckForUpdates
source: Check for updates automatically
pt_br: Verificar atualizações automaticamente

# Settings_DnsProvider
source: Default DNS Provider
pt_br: Provedor DNS Padrão

# Settings_DnsProviderDescription
source: Select the DNS provider to use by default
pt_br: Selecione o provedor DNS a ser usado por padrão

# Tray_Open
source: Open SDfW
pt_br: Abrir SDfW

# Tray_EnableProtection
source: Enable DNS protection
pt_br: Ativar proteção DNS

# Tray_DisableProtection
source: Disable DNS protection
pt_br: Desativar proteção DNS

# Tray_FlushDns
source: Flush DNS cache
pt_br: Limpar cache DNS

# Tray_Exit
source: Exit
pt_br: Sair

# Notification_DnsEnabled
source: DNS protection enabled
pt_br: Proteção DNS ativada

# Notification_DnsDisabled
source: DNS protection disabled
pt_br: Proteção DNS desativada

# Notification_RevertedToDefault
source: Reverted to default provider
pt_br: Revertido para provedor padrão

# Notification_DnsCacheFlushed
source: DNS cache flushed successfully
pt_br: Cache DNS limpo com sucesso

# Notification_ConfigureDefaultFirst
source: Configure a default profile first
pt_br: Configure um perfil padrão primeiro

# Notification_ErrorEnabling
source: Error enabling DNS protection
pt_br: Erro ao ativar proteção DNS

# Notification_ErrorDisabling
source: Error disabling DNS protection
pt_br: Erro ao desativar proteção DNS

# Notification_ErrorFlushingCache
source: Error flushing DNS cache
pt_br: Erro ao limpar cache DNS

# Dialog_AlreadyRunning
source: Simple DNS for Windows is already running.\n\nCheck the system tray.
pt_br: O Simple DNS for Windows já está em execução.\n\nVerifique a bandeja do sistema.

# Common_Yes
source: Yes
pt_br: Sim

# Common_No
source: No
pt_br: Não

source: Update available
pt_br: Atualização disponível

# Update_NewVersionAvailable
source: A new version ({0}) is available!
pt_br: Uma nova versão ({0}) está disponível!

# Update_CurrentVersion
source: Current version: {0}
pt_br: Versão atual: {0}

# Update_Download
source: Download
pt_br: Baixar

# Update_Later
source: Later
pt_br: Mais tarde
